package Interface;

import java.util.regex.Matcher;
import java.util.regex.Pattern;

/**
 * Description：
 * Author: Administrator
 * Created:  2017/12/13 12:52
 * Copyright: Copyright (c) 2017
 * Version: 0.0.1
 * Modified By:
 */
public class Test {
    public static void main(String[] args) {
        String html = "<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n" +
                "<html>\n" +
                "  <head/>\n" +
                "  <body>\n" +
                "    \n" +
                "\n" +
                "\uFEFF\n" +
                "\n" +
                "\uFEFF\n" +
                "\n" +
                "\n" +
                "\n" +
                "    <p style=\"MARGIN: 0px; LINE-HEIGHT: 150%\">\n" +
                "      <font face=\"宋体\" size=\"2\">\n" +
                "        【颁布日期】1991-04-11\n" +
                "        <br/>\n" +
                "        【实施日期】1991-01-01\n" +
                "        <br/>\n" +
                "        【有效性】失效\n" +
                "        <br/>\n" +
                "        【全文】\n" +
                "        <br/>\n" +
                "      </font>\n" +
                "    </p>\n" +
                "    <p style=\"MARGIN: 0px; LINE-HEIGHT: 150%\">\n" +
                "    </p>\n" +
                "    <p style=\"MARGIN: 0px; LINE-HEIGHT: 150%\">\n" +
                "    </p>\n" +
                "    <p style=\"MARGIN: 0px; LINE-HEIGHT: 150%\" align=\"center\">\n" +
                "      <font class=\".TopicHead\" face=\"宋体\" size=\"4\">\n" +
                "        <b>\n" +
                "          出口奖励金财务管理办法\n" +
                "        </b>\n" +
                "      </font>\n" +
                "    </p>\n" +
                "    <p style=\"MARGIN: 0px; LINE-HEIGHT: 150%\" align=\"center\">\n" +
                "      <font class=\".TopicHead\" face=\"宋体\" size=\"3\">\n" +
                "        1991年4月11日\n" +
                "      </font>\n" +
                "    </p>\n" +
                "    <p style=\"MARGIN: 0px; LINE-HEIGHT: 150%\" align=\"center\">\n" +
                "    </p>\n" +
                "    <p style=\"MARGIN: 0px; LINE-HEIGHT: 150%\" align=\"left\">\n" +
                "      <font class=\".TopicHead\" face=\"宋体\" size=\"2\">\n" +
                "        　　（1991年4月11日财政部、对外贸易经济合作部发布）\n" +
                "      </font>\n" +
                "    </p>\n" +
                "    <p style=\"MARGIN: 0px; LINE-HEIGHT: 150%\">\n" +
                "      <font face=\"宋体\" size=\"2\">\n" +
                "        <font class=\".TiaoMu\">\n" +
                "          　　第一条 \n" +
                "        </font>\n" +
                "        为了加强出口奖励金的财务管理，完善鼓励出口的政策，正确处理国家与企业的分配关系，特制定本办法。\n" +
                "        <br/>\n" +
                "        <font class=\".TiaoMu\">\n" +
                "          　　第二条 \n" +
                "        </font>\n" +
                "        本办法适用下列出口企业：\n" +
                "        <br/>\n" +
                "        　　1.经批准有出口经营权并承担国家出口计划和上缴中央外汇额度任务的外贸出口企业，包括财务关系隶属各级经贸部门的各类外贸出口企业以及财务直接与各级财政部门挂钩并归口管理的各类外贸出口企业。\n" +
                "        <br/>\n" +
                "        　　2.为外贸出口企业提供货源的出口供货企业。\n" +
                "        <br/>\n" +
                "        　　上述外贸出口企业不包括石油代理出口业务，出不供货企业提供的货源不包括石油、煤炭和军品。\n" +
                "        <br/>\n" +
                "        <font class=\".TiaoMu\">\n" +
                "          　　第三条 \n" +
                "        </font>\n" +
                "        国家按实际出口收汇每一美元奖励外贸出口企业二分人民币和一美分外汇额度（以下简称“外贸出口奖励金”），奖励出口供货企业五分人民币（以下简称“供货出口奖励金”）。\n" +
                "        <br/>\n" +
                "        　　实际出口收汇数外外贸出口结汇收入扣除外汇运保费、佣金、赔款和银行手续费、归还以进养出周转外汇本金及外汇贷款本息后的净收汇。\n" +
                "        <br/>\n" +
                "        　　计提外贸出口奖励金以实际收汇数扣除外汇额度奖励部分后，按每美元计提人民币二分。\n" +
                "        <br/>\n" +
                "        <font class=\".TiaoMu\">\n" +
                "          　　第四条 \n" +
                "        </font>\n" +
                "        出口企业所得出口奖励金列作留利资金分配使用。\n" +
                "        <br/>\n" +
                "        　　1.外贸出口奖励金以向国家承包出口收汇任务的外贸出口企业为兑现单位，国家考核其承包的出口总额、出口收汇和上交中央外汇额度以及企业盈亏四项指标。\n" +
                "        <br/>\n" +
                "        　　2.供货出口奖励金由收购出口商品的外贸出口企业按出口收汇提取并及时支付给有关出口供货企业。支付轻纺产品的供货出口奖励金，分别按轻工部，纺织部、财政部、经贸部（87）轻计字第85号、（87）纺生字第027号规定的分档次奖励标准并另顺加二分执行，各档次顺加二分后，不再划分基数内外进行兑现。\n" +
                "        <br/>\n" +
                "        　　3.外贸出口企业可依据实际出口收汇按月预提百分之六十外贸出口奖励金和应付供货出口奖励金。为及时兑现出口奖励金，财政部按财务隶属关系将全年的出口奖励金按月等比例地预拨给各地方财政厅（局）和经贸部、中央工贸公司，逐级预拨给企业，年终清算。\n" +
                "        <br/>\n" +
                "        　　4.年终清算时，财政部门和主管部门按财务隶属关系对外贸出口奖励金依据四项考核指标完成情况进行清算，其中：完成出口总额、出口收汇、上交中央外汇额度三项指标各兑现20%，完成盈亏承包指标兑现40%。对外贸出口企业应付供货出口奖励金按上交中央外汇指标完成情况进行清算。\n" +
                "        <br/>\n" +
                "        　　5.经过年终清算，对承包基数内出口奖励金，各级财政部门和各级经贸部门应足额兑现，不得截留。对超承包基数完成四项考核指标的外贸企业，经批准超承包出口收汇任务的超收外汇部份每美元可按本办法第三条规定的标准加提一分人民币超基数出口奖励金，由外贸出口企业自行负担，国家不予拨付；未完成四项考核指标的外贸企业，不得提取超基数出口奖励金。\n" +
                "        <br/>\n" +
                "        <font class=\".TiaoMu\">\n" +
                "          　　第五条 \n" +
                "        </font>\n" +
                "        对于中央外贸出口企业承包地方出口任务或地方外贸出口企业承包中央外贸出口企业的任务的，其承包基数内的出口奖励金按（91）财商字43号文件规定的渠道拨付。\n" +
                "        <br/>\n" +
                "        <font class=\".TiaoMu\">\n" +
                "          　　第六条 \n" +
                "        </font>\n" +
                "        外贸出口奖励金不论基数内外，一律先通过“利润分配”提取。转作专用基金后，按“五、二、三”比例分配使用，即50%用于发展生产及改善工作条件，20%用于职工福利，30%用于职工奖励。各级外贸出口企业发放奖金、改善职工福利，应严格执行国家有关规定，不得滥发奖金和福利费（包括实物）。\n" +
                "        <br/>\n" +
                "        <font class=\".TiaoMu\">\n" +
                "          　　第七条 \n" +
                "        </font>\n" +
                "        外贸出口企业外汇额度奖励金由外贸出口企业按实际出口收汇从外汇留成中自行提取，按规定用途使用后，如有结余，可参与外汇调剂市场进行调剂，调剂收入用于弥补企业亏损或列作专用基金；转专用基金时应按第六条规定的比例分配使用。\n" +
                "        <br/>\n" +
                "        <font class=\".TiaoMu\">\n" +
                "          　　第八条 \n" +
                "        </font>\n" +
                "        供货出口奖励金不论承包基数内外，全部计入外贸出口企业总成本，但不分摊到具体商品成本内。对于出口商品国内价格已经放开、随行就市收购的，或者零星收购、无法兑现给具体出口供货企业的，或者供销双方商定已在价格中给予补偿、不再事后承付的供货出口奖励金，外贸出口企业应按收购合同认真结算，年终将结余的供货出口奖励金，完成承包盈亏指标的企业，全部转入企业专用基金中的生产发展基金，不得用于职工福利和奖励；未完成承包盈亏指标的企业，要先用于弥补亏损。\n" +
                "        <br/>\n" +
                "        　　出口供货企业收到供货出口奖励金后，直接列入税后留利，大部分用于发展生产，提高出口产品质量，小部分用于增发职工奖励。增发职工奖金继续执行现行“不得超过一个月，并免征奖金税”的规定。\n" +
                "        <br/>\n" +
                "        　　出口商品发生国外索赔，如属出口供货企业的责任，外贸出口企业要相应扣除应付的供货出口奖励金，用以抵补对外理赔损失。\n" +
                "        <br/>\n" +
                "        <font class=\".TiaoMu\">\n" +
                "          　　第九条 \n" +
                "        </font>\n" +
                "        外贸部门自属独立核算的加工生产企业，可享受出口供货企业的供货出口奖励待遇，按第六条规定的比例在专用基金中分配。但其供货出口奖励金应由调入出口商品的外贸出口企业支付，不得自行从加工生产成本中提取。\n" +
                "        <br/>\n" +
                "        <font class=\".TiaoMu\">\n" +
                "          　　第十条 \n" +
                "        </font>\n" +
                "        对于财务虽与各级财政部门挂钩，但财政部门没有实行归口管理的各类外贸出口企业是否执行本办法，由其主管部门提出意见报同级财政部门审定。\n" +
                "        <br/>\n" +
                "        　　经国家批准具有出口经营权的生产企业，其自营出口部门独立核算、具备法人资格、财务单独与财政部门挂钩的，按本办法第二条第一款或本条前款规定执行；如不同时具备上述三个条件，则按出口供货企业对待，所需供货出口奖励金经同级财政部门批准后，从其自营出口销售成本中按本办法规定提取。\n" +
                "        <br/>\n" +
                "        <font class=\".TiaoMu\">\n" +
                "          　　第十一条 \n" +
                "        </font>\n" +
                "        地方政府承包中央出口收汇任务所需出口奖励金，由中央财政承担，列入地方预算管理，不调整地方财政体制收支基数。年终，中央财政根据地方上交中央外汇基数（包括有偿上交和无偿上交）完成情况，与地方财政单独结算。各级财政部门拨付出口奖励金，列“外贸企业亏损补贴”科目。\n" +
                "        <br/>\n" +
                "        <font class=\".TiaoMu\">\n" +
                "          　　第十二条 \n" +
                "        </font>\n" +
                "        为了解决外贸出口企业之间分配悬殊过大问题，各级财政部门、经贸部门及中央外贸进出口总公司兑现本地区、本系统企业的外贸出口奖励金时，可按财务隶属关系适当集中，调剂余缺。对集中的外贸出口奖励金，应与本单位的财务完全分开，不得用于本单位职工福利和奖励开支，也不得用于应由行政事业经费及基本建设投资解决的各项支出。\n" +
                "        <br/>\n" +
                "        <font class=\".TiaoMu\">\n" +
                "          　　第十三条 \n" +
                "        </font>\n" +
                "        外贸出口企业凡执行本办法的，不再提企业基金和按实现利润提取全额利润留成。按工资总额扣除各种价格补贴、各种奖金以及落实政策补发工资后数额的百分之十一计提职工福利费的办法仍继续执行。\n" +
                "        <br/>\n" +
                "        <font class=\".TiaoMu\">\n" +
                "          　　第十四条 \n" +
                "        </font>\n" +
                "        各级财政部门对出口奖励金的提取、拨付、使用等管理应加强检查监督，对违反本办法规定，多提多列、虚报冒领和强令退库、挪用出口奖励金的部门、企业，要按《国务院关于违反财政法规处罚的暂行规定》第六条、第七条、第八条及第九条有关规定严肃处理。\n" +
                "        <br/>\n" +
                "        <font class=\".TiaoMu\">\n" +
                "          　　第十五条 \n" +
                "        </font>\n" +
                "        本办法从一九九一年一月一日起实行。财政部、经贸部以前有关外贸企业提取出口奖励金的规定和鼓励出口收汇奖励办法同时废止。各地可根据本办法结合当地情况，制定具体实施办法，并抄报财政部、经贸部备案。\n" +
                "      </font>\n" +
                "    </p>\n" +
                "    <p style=\"MARGIN: 0px; LINE-HEIGHT: 150%\">\n" +
                "      <font class=\"inv1\" face=\"宋体\" size=\"2\">\n" +
                "        　　*注：本篇法规已被《财政部关于公布废止和失效的财政规章目录（第五批）的通知》（发布日期：1993年12月13日 实施日期：1993年12月13日）宣布失效\n" +
                "      </font>\n" +
                "    </p>\n" +
                "  </body>\n" +
                "</html>\n";
        System.out.println(cleanHtml(html));

    }

    public static String cleanHtml(String html) {
        String result = html;
        String regEx_return = "\t|\r|\n";//定义空格回车换行符
        Pattern p_return = Pattern.compile(regEx_return, Pattern.CASE_INSENSITIVE);
        Matcher m_return = p_return.matcher(result);
        result = m_return.replaceAll("").replaceAll("　", " "); // 过滤空格回车标签

        String regEx_html = "<br>|<br />|<br/>|</p>|</div>|</li>"; // 定义HTML标签的正则表达式
        Pattern p_html = Pattern.compile(regEx_html, Pattern.CASE_INSENSITIVE);
        Matcher m_html = p_html.matcher(result);
        result = m_html.replaceAll("\n"); // 过滤html标签

        String regEx2_html = "<[^>]+>"; // 定义HTML标签的正则表达式
        Pattern p2_html = Pattern.compile(regEx2_html, Pattern.CASE_INSENSITIVE);
        Matcher m2_html = p2_html.matcher(result);
        result = m2_html.replaceAll(""); // 过滤html标签

        result = result.replaceAll(" +", " ").trim(); // 过滤空格回车标签

        return result;
    }
}
